jgroman/psoc_talking_clock/Generated_Source/PSoC4/VDAC_Synth_UAB_regs.h
#define VDAC_Synth_UAB_SW_CC_IN0_ADDR                (VDAC_Synth_UAB_halfuab__SW_CC_IN0)
#define VDAC_Synth_UAB_SW_CC_IN0_PTR                ((reg32*)VDAC_Synth_UAB_SW_CC_IN0_ADDR)
#define VDAC_Synth_UAB_SW_CC_IN0_REG                (*(VDAC_Synth_UAB_SW_CC_IN0_PTR))

#define VDAC_Synth_UAB_SW_CC_IN1_ADDR                (VDAC_Synth_UAB_halfuab__SW_CC_IN1)
#define VDAC_Synth_UAB_SW_CC_IN1_PTR                ((reg32*)VDAC_Synth_UAB_SW_CC_IN1_ADDR)
#define VDAC_Synth_UAB_SW_CC_IN1_REG                (*(VDAC_Synth_UAB_SW_CC_IN1_PTR))

#define VDAC_Synth_UAB_SW_CC_TOP_ADDR                (VDAC_Synth_UAB_halfuab__SW_CC_TOP)
#define VDAC_Synth_UAB_SW_CC_TOP_PTR                ((reg32*)VDAC_Synth_UAB_SW_CC_TOP_ADDR)
#define VDAC_Synth_UAB_SW_CC_TOP_REG                (*(VDAC_Synth_UAB_SW_CC_TOP_PTR))

#define VDAC_Synth_UAB_SW_CF_BOT_ADDR                (VDAC_Synth_UAB_halfuab__SW_CF_BOT)
#define VDAC_Synth_UAB_SW_CF_BOT_PTR                ((reg32*)VDAC_Synth_UAB_SW_CF_BOT_ADDR)
#define VDAC_Synth_UAB_SW_CF_BOT_REG                (*(VDAC_Synth_UAB_SW_CF_BOT_PTR))

#define VDAC_Synth_UAB_SW_OTHER_ADDR                 (VDAC_Synth_UAB_halfuab__SW_OTHER)
#define VDAC_Synth_UAB_SW_OTHER_PTR                 ((reg32*)VDAC_Synth_UAB_SW_OTHER_ADDR)
#define VDAC_Synth_UAB_SW_OTHER_REG                 (*(VDAC_Synth_UAB_SW_OTHER_PTR))

#define VDAC_Synth_UAB_SW_BOOST_CTRL_ADDR            (VDAC_Synth_UAB_halfuab__SW_BOOST_CTRL)
#define VDAC_Synth_UAB_SW_BOOST_CTRL_PTR            ((reg32*)VDAC_Synth_UAB_SW_BOOST_CTRL_ADDR)
#define VDAC_Synth_UAB_SW_BOOST_CTRL_REG            (*(VDAC_Synth_UAB_SW_BOOST_CTRL_PTR))

#define VDAC_Synth_UAB_SRAM_CTRL_ADDR                (VDAC_Synth_UAB_halfuab__SRAM_CTRL)
#define VDAC_Synth_UAB_SRAM_CTRL_PTR                ((reg32*)VDAC_Synth_UAB_SRAM_CTRL_ADDR)
#define VDAC_Synth_UAB_SRAM_CTRL_REG                (*(VDAC_Synth_UAB_SRAM_CTRL_PTR))

#define VDAC_Synth_UAB_STAT_ADDR                     (VDAC_Synth_UAB_halfuab__STAT)
#define VDAC_Synth_UAB_STAT_PTR                     ((reg32*)VDAC_Synth_UAB_STAT_ADDR)
#define VDAC_Synth_UAB_STAT_REG                     (*(VDAC_Synth_UAB_STAT_PTR))

#define VDAC_Synth_UAB_SRAM0_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM0)
#define VDAC_Synth_UAB_SRAM0_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM0_ADDR)
#define VDAC_Synth_UAB_SRAM0_REG                    (*(VDAC_Synth_UAB_SRAM0_PTR))

#define VDAC_Synth_UAB_SRAM1_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM1)
#define VDAC_Synth_UAB_SRAM1_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM1_ADDR)
#define VDAC_Synth_UAB_SRAM1_REG                    (*(VDAC_Synth_UAB_SRAM1_PTR))

#define VDAC_Synth_UAB_SRAM2_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM2)
#define VDAC_Synth_UAB_SRAM2_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM2_ADDR)
#define VDAC_Synth_UAB_SRAM2_REG                    (*(VDAC_Synth_UAB_SRAM2_PTR))

#define VDAC_Synth_UAB_SRAM3_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM3)
#define VDAC_Synth_UAB_SRAM3_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM3_ADDR)
#define VDAC_Synth_UAB_SRAM3_REG                    (*(VDAC_Synth_UAB_SRAM3_PTR))

#define VDAC_Synth_UAB_SRAM4_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM4)
#define VDAC_Synth_UAB_SRAM4_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM4_ADDR)
#define VDAC_Synth_UAB_SRAM4_REG                    (*(VDAC_Synth_UAB_SRAM4_PTR))

#define VDAC_Synth_UAB_SRAM5_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM5)
#define VDAC_Synth_UAB_SRAM5_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM5_ADDR)
#define VDAC_Synth_UAB_SRAM5_REG                    (*(VDAC_Synth_UAB_SRAM5_PTR))

#define VDAC_Synth_UAB_SRAM6_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM6)
#define VDAC_Synth_UAB_SRAM6_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM6_ADDR)
#define VDAC_Synth_UAB_SRAM6_REG                    (*(VDAC_Synth_UAB_SRAM6_PTR))

#define VDAC_Synth_UAB_SRAM7_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM7)
#define VDAC_Synth_UAB_SRAM7_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM7_ADDR)
#define VDAC_Synth_UAB_SRAM7_REG                    (*(VDAC_Synth_UAB_SRAM7_PTR))

#define VDAC_Synth_UAB_SRAM8_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM8)
#define VDAC_Synth_UAB_SRAM8_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM8_ADDR)
#define VDAC_Synth_UAB_SRAM8_REG                    (*(VDAC_Synth_UAB_SRAM8_PTR))

#define VDAC_Synth_UAB_SRAM9_ADDR                    (VDAC_Synth_UAB_halfuab__SRAM9)
#define VDAC_Synth_UAB_SRAM9_PTR                    ((reg32*)VDAC_Synth_UAB_SRAM9_ADDR)
#define VDAC_Synth_UAB_SRAM9_REG                    (*(VDAC_Synth_UAB_SRAM9_PTR))

#define VDAC_Synth_UAB_SRAM10_ADDR                   (VDAC_Synth_UAB_halfuab__SRAM10)
#define VDAC_Synth_UAB_SRAM10_PTR                   ((reg32*)VDAC_Synth_UAB_SRAM10_ADDR)
#define VDAC_Synth_UAB_SRAM10_REG                   (*(VDAC_Synth_UAB_SRAM10_PTR))

#define VDAC_Synth_UAB_SRAM11_ADDR                   (VDAC_Synth_UAB_halfuab__SRAM11)
#define VDAC_Synth_UAB_SRAM11_PTR                   ((reg32*)VDAC_Synth_UAB_SRAM11_ADDR)
#define VDAC_Synth_UAB_SRAM11_REG                   (*(VDAC_Synth_UAB_SRAM11_PTR))

#define VDAC_Synth_UAB_SRAM12_ADDR                   (VDAC_Synth_UAB_halfuab__SRAM12)
#define VDAC_Synth_UAB_SRAM12_PTR                   ((reg32*)VDAC_Synth_UAB_SRAM12_ADDR)
#define VDAC_Synth_UAB_SRAM12_REG                   (*(VDAC_Synth_UAB_SRAM12_PTR))

#define VDAC_Synth_UAB_SRAM13_ADDR                   (VDAC_Synth_UAB_halfuab__SRAM13)
#define VDAC_Synth_UAB_SRAM13_PTR                   ((reg32*)VDAC_Synth_UAB_SRAM13_ADDR)
#define VDAC_Synth_UAB_SRAM13_REG                   (*(VDAC_Synth_UAB_SRAM13_PTR))

#define VDAC_Synth_UAB_SRAM14_ADDR                   (VDAC_Synth_UAB_halfuab__SRAM14)
#define VDAC_Synth_UAB_SRAM14_PTR                   ((reg32*)VDAC_Synth_UAB_SRAM14_ADDR)
#define VDAC_Synth_UAB_SRAM14_REG                   (*(VDAC_Synth_UAB_SRAM14_PTR))

#define VDAC_Synth_UAB_SRAM15_ADDR                   (VDAC_Synth_UAB_halfuab__SRAM15)
#define VDAC_Synth_UAB_SRAM15_PTR                   ((reg32*)VDAC_Synth_UAB_SRAM15_ADDR)
#define VDAC_Synth_UAB_SRAM15_REG                   (*(VDAC_Synth_UAB_SRAM15_PTR))

