jgroman/psoc_talking_clock/Generated_Source/PSoC4/VDAC_Synth_UAB_regs.h
/*CAP_ABCF_VAL, CAP_AB_VAL_NXT, and CAP_CF_VAL_NXT*/
#define VDAC_Synth_UAB_CB_VAL_SHIFT                 CyUAB_CB_VAL_SHIFT
#define VDAC_Synth_UAB_CB_VAL_MASK                  (0x3fUL<<VDAC_Synth_UAB_CB_VAL_SHIFT)

#define VDAC_Synth_UAB_CA_VAL_SHIFT                 CyUAB_CA_VAL_SHIFT
#define VDAC_Synth_UAB_CA_VAL_MASK                  (0x3fUL<<VDAC_Synth_UAB_CA_VAL_SHIFT)

#define VDAC_Synth_UAB_SIGN_VAL_SHIFT               CyUAB_SIGN_VAL_SHIFT
#define VDAC_Synth_UAB_SIGN_VAL_MASK                (1UL<<VDAC_Synth_UAB_SIGN_VAL_SHIFT)

#define VDAC_Synth_UAB_CB_64_SHIFT                  CyUAB_CB_64_SHIFT
#define VDAC_Synth_UAB_CB_64_MASK                   (1UL<<VDAC_Synth_UAB_CB_64_SHIFT)

#define VDAC_Synth_UAB_CC_VAL_SHIFT                 CyUAB_CC_VAL_SHIFT
#define VDAC_Synth_UAB_CC_VAL_MASK                  (0x3fUL<<VDAC_Synth_UAB_CC_VAL_SHIFT)

#define VDAC_Synth_UAB_CF_VAL_SHIFT                 CyUAB_CF_VAL_SHIFT
#define VDAC_Synth_UAB_CF_VAL_MASK                  (0x1fUL<<VDAC_Synth_UAB_CF_VAL_SHIFT)


/*CAP_CF_VAL_NXT*/
#define VDAC_Synth_UAB_CC_VAL_UPDATE_SHIFT          CyUAB_CC_VAL_UPDATE_SHIFT
#define VDAC_Synth_UAB_CC_VAL_UPDATE_MASK           (1UL<<VDAC_Synth_UAB_CC_VAL_UPDATE_SHIFT)

#define VDAC_Synth_UAB_CF_VAL_UPDATE_SHIFT          CyUAB_CF_VAL_UPDATE_SHIFT
#define VDAC_Synth_UAB_CF_VAL_UPDATE_MASK           (1UL<<VDAC_Synth_UAB_CF_VAL_UPDATE_SHIFT)


/*STARTUP_DELAY*/
#define VDAC_Synth_UAB_STARTUP_DELAY_SHIFT          CyUAB_STARTUP_DELAY_SHIFT
#define VDAC_Synth_UAB_STARTUP_DELAY_MASK           (0x0000ffffUL)

#define VDAC_Synth_UAB_ALIGN_MODE_SHIFT             CyUAB_ALIGN_MODE_SHIFT
#define VDAC_Synth_UAB_ALIGN_MODE_MASK              (1UL<<VDAC_Synth_UAB_ALIGN_MODE_SHIFT)


/*SUBSAMPLE_CTRL*/
#define VDAC_Synth_UAB_SUBSAMPLE_SHIFT              CyUAB_SUBSAMPLE_SHIFT
#define VDAC_Synth_UAB_SUBSAMPLE_MASK               (0xffUL<<VDAC_Synth_UAB_SUBSAMPLE_SHIFT)

#define VDAC_Synth_UAB_SUBSAMPLE_INIT_SHIFT         CyUAB_SUBSAMPLE_INIT_SHIFT
#define VDAC_Synth_UAB_SUBSAMPLE_INIT_MASK          (0xffUL<<VDAC_Synth_UAB_SUBSAMPLE_INIT_SHIFT)


/*SW_STATIC*/
#define VDAC_Synth_UAB_SW_G0_SHIFT                  CyUAB_SW_G0_SHIFT
#define VDAC_Synth_UAB_SW_G0_MASK                   (1UL<<VDAC_Synth_UAB_SW_G0_SHIFT)

#define VDAC_Synth_UAB_SW_G1_SHIFT                  CyUAB_SW_G1_SHIFT
#define VDAC_Synth_UAB_SW_G1_MASK                   (1UL<<VDAC_Synth_UAB_SW_G1_SHIFT)

#define VDAC_Synth_UAB_SW_G2_SHIFT                  CyUAB_SW_G2_SHIFT
#define VDAC_Synth_UAB_SW_G2_MASK                   (1UL<<VDAC_Synth_UAB_SW_G2_SHIFT)

#define VDAC_Synth_UAB_SW_G3_SHIFT                  CyUAB_SW_G3_SHIFT
#define VDAC_Synth_UAB_SW_G3_MASK                   (1UL<<VDAC_Synth_UAB_SW_G3_SHIFT)

#define VDAC_Synth_UAB_SW_RG_SHIFT                  CyUAB_SW_RG_SHIFT
#define VDAC_Synth_UAB_SW_RG_MASK                   (1UL<<VDAC_Synth_UAB_SW_RG_SHIFT)

#define VDAC_Synth_UAB_SW_GG_SHIFT                  CyUAB_SW_GG_SHIFT
#define VDAC_Synth_UAB_SW_GG_MASK                   (1UL<<VDAC_Synth_UAB_SW_GG_SHIFT)

#define VDAC_Synth_UAB_SW_RT_SHIFT                  CyUAB_SW_RT_SHIFT
#define VDAC_Synth_UAB_SW_RT_MASK                   (1UL<<VDAC_Synth_UAB_SW_RT_SHIFT)

#define VDAC_Synth_UAB_SW_GT_SHIFT                  CyUAB_SW_GT_SHIFT
#define VDAC_Synth_UAB_SW_GT_MASK                   (1UL<<VDAC_Synth_UAB_SW_GT_SHIFT)

#define VDAC_Synth_UAB_SW_QT_SHIFT                  CyUAB_SW_QT_SHIFT
#define VDAC_Synth_UAB_SW_QT_MASK                   (1UL<<VDAC_Synth_UAB_SW_QT_SHIFT)

#define VDAC_Synth_UAB_EARLY_PS_SHIFT               CyUAB_EARLY_PS_SHIFT
#define VDAC_Synth_UAB_EARLY_PS_MASK                (1UL<<VDAC_Synth_UAB_EARLY_PS_SHIFT)

#define VDAC_Synth_UAB_EARLY_PO_SHIFT               CyUAB_EARLY_PO_SHIFT
#define VDAC_Synth_UAB_EARLY_PO_MASK                (1UL<<VDAC_Synth_UAB_EARLY_PO_SHIFT)

#define VDAC_Synth_UAB_STRB_RST_SEL_SHIFT           CyUAB_STRB_RST_SEL_SHIFT
#define VDAC_Synth_UAB_STRB_RST_SEL_MASK            (0x1fUL<<VDAC_Synth_UAB_STRB_RST_SEL_SHIFT)

#define VDAC_Synth_UAB_STRB_RST_EN_SHIFT            CyUAB_STRB_RST_EN_SHIFT
#define VDAC_Synth_UAB_STRB_RST_EN_MASK             (1UL<<VDAC_Synth_UAB_STRB_RST_EN_SHIFT)


/*SW_MODBIT_SRC*/
#define VDAC_Synth_UAB_MODBIT0_SRC_SEL_SHIFT        CyUAB_MODBIT0_SRC_SEL_SHIFT
#define VDAC_Synth_UAB_MODBIT0_SRC_SEL_MASK         (0x1fUL<<VDAC_Synth_UAB_MODBIT0_SRC_SEL_SHIFT)

#define VDAC_Synth_UAB_MODBIT1_SRC_SEL_SHIFT        CyUAB_MODBIT1_SRC_SEL_SHIFT
#define VDAC_Synth_UAB_MODBIT1_SRC_SEL_MASK         (0x1fUL<<VDAC_Synth_UAB_MODBIT1_SRC_SEL_SHIFT)


/*SW_CA_IN0*/
#define VDAC_Synth_UAB_SW_A0_MODBIT_SHIFT           CyUAB_SW_A0_MODBIT_SHIFT
#define VDAC_Synth_UAB_SW_A0_MODBIT_MASK            (0xfUL<<VDAC_Synth_UAB_SW_A0_MODBIT_SHIFT)

#define VDAC_Synth_UAB_SW_A1_MODBIT_SHIFT           CyUAB_SW_A1_MODBIT_SHIFT
#define VDAC_Synth_UAB_SW_A1_MODBIT_MASK            (0xfUL<<VDAC_Synth_UAB_SW_A1_MODBIT_SHIFT)

#define VDAC_Synth_UAB_SW_A2_MODBIT_SHIFT           CyUAB_SW_A2_MODBIT_SHIFT
#define VDAC_Synth_UAB_SW_A2_MODBIT_MASK            (0xfUL<<VDAC_Synth_UAB_SW_A2_MODBIT_SHIFT)

#define VDAC_Synth_UAB_SW_A3_MODBIT_SHIFT           CyUAB_SW_A3_MODBIT_SHIFT
#define VDAC_Synth_UAB_SW_A3_MODBIT_MASK            (0xfUL<<VDAC_Synth_UAB_SW_A3_MODBIT_SHIFT)

#define VDAC_Synth_UAB_SW_AP_SHIFT                  CyUAB_SW_AP_SHIFT
#define VDAC_Synth_UAB_SW_AP_MASK                   (0xfUL<<VDAC_Synth_UAB_SW_AP_SHIFT)

#define VDAC_Synth_UAB_SW_AQ_SHIFT                  CyUAB_SW_AQ_SHIFT
#define VDAC_Synth_UAB_SW_AQ_MASK                   (0xfUL<<VDAC_Synth_UAB_SW_AQ_SHIFT)

/*SW_CA_IN1*/    
#define VDAC_Synth_UAB_SW_AA_SHIFT                  CyUAB_SW_AA_SHIFT
#define VDAC_Synth_UAB_SW_AA_MASK                   (0xfUL<<VDAC_Synth_UAB_SW_AA_SHIFT)

#define VDAC_Synth_UAB_SW_AR_MODBIT_SHIFT           CyUAB_SW_AR_MODBIT_SHIFT
#define VDAC_Synth_UAB_SW_AR_MODBIT_MASK            (0xfUL<<VDAC_Synth_UAB_SW_AR_MODBIT_SHIFT)

#define VDAC_Synth_UAB_SW_AG_MODBIT_SHIFT           CyUAB_SW_AG_MODBIT_SHIFT
#define VDAC_Synth_UAB_SW_AG_MODBIT_MASK            (0xfUL<<VDAC_Synth_UAB_SW_AG_MODBIT_SHIFT)

#define VDAC_Synth_UAB_SW_AV_MODBIT_SHIFT           CyUAB_SW_AV_MODBIT_SHIFT
#define VDAC_Synth_UAB_SW_AV_MODBIT_MASK            (0xfUL<<VDAC_Synth_UAB_SW_AV_MODBIT_SHIFT)


