jgroman/psoc_talking_clock/Generated_Source/PSoC4/VDAC_Synth_UAB_regs.h
/*SRAM_CTRL*/
#define VDAC_Synth_UAB_LAST_STEP_SHIFT              CyUAB_LAST_STEP_SHIFT
#define VDAC_Synth_UAB_LAST_STEP_MASK               (0xfUL<<VDAC_Synth_UAB_LAST_STEP_SHIFT)

#define VDAC_Synth_UAB_TRIG_SEL_SHIFT               CyUAB_TRIG_SEL_SHIFT
#define VDAC_Synth_UAB_TRIG_SEL_MASK                (0x1fUL<<VDAC_Synth_UAB_TRIG_SEL_SHIFT)

#define VDAC_Synth_UAB_TRIGGER_EN_SHIFT             CyUAB_TRIGGER_EN_SHIFT
#define VDAC_Synth_UAB_TRIGGER_EN_MASK              (1UL<<VDAC_Synth_UAB_TRIGGER_EN_SHIFT)

#define VDAC_Synth_UAB_RUN_SHIFT                    CyUAB_RUN_SHIFT
#define VDAC_Synth_UAB_RUN_MASK                     (1UL<<VDAC_Synth_UAB_RUN_SHIFT)


/*STAT*/
#define VDAC_Synth_UAB_CURR_STEP_SHIFT              CyUAB_CURR_STEP_SHIFT
#define VDAC_Synth_UAB_CURR_STEP_MASK               (0xfUL<<VDAC_Synth_UAB_CURR_STEP_SHIFT)

#define VDAC_Synth_UAB_COMP_SHIFT                   CyUAB_COMP_SHIFT
#define VDAC_Synth_UAB_COMP_MASK                    (1UL<<VDAC_Synth_UAB_COMP_SHIFT)

#define VDAC_Synth_UAB_CURR_SUBSAMPLE_SHIFT         CyUAB_CURR_SUBSAMPLE_SHIFT
#define VDAC_Synth_UAB_CURR_SUBSAMPLE_MASK          (0xffUL<<VDAC_Synth_UAB_CURR_SUBSAMPLE_SHIFT)


/*SRAM*/
#define VDAC_Synth_UAB_WAVE_STEP_SHIFT              CyUAB_WAVE_STEP_SHIFT
#define VDAC_Synth_UAB_WAVE_STEP_MASK               (0x0000ffffUL)


/*CAP_TRIM*/
#define VDAC_Synth_UAB_CBTC_VAL_SHIFT               CyUAB_CBTC_VAL_SHIFT
#define VDAC_Synth_UAB_CBTC_VAL_MASK                (0x7UL<<VDAC_Synth_UAB_CBTC_VAL_SHIFT)

#define VDAC_Synth_UAB_CCTC_VAL_SHIFT               CyUAB_CCTC_VAL_SHIFT
#define VDAC_Synth_UAB_CCTC_VAL_MASK                (0x7UL<<VDAC_Synth_UAB_CCTC_VAL_SHIFT)


/*OA_TRIM*/
#define VDAC_Synth_UAB_OA_OFFSET_SHIFT              CyUAB_OA_OFFSET_SHIFT
#define VDAC_Synth_UAB_OA_OFFSET_MASK               (0xfUL<<VDAC_Synth_UAB_OA_OFFSET_SHIFT)

#define VDAC_Synth_UAB_REF_OFFSET_SHIFT             CyUAB_REF_OFFSET_SHIFT
#define VDAC_Synth_UAB_REF_OFFSET_MASK              (0x1fUL<<VDAC_Synth_UAB_REF_OFFSET_SHIFT)

#define VDAC_Synth_UAB_AGND_OFFSET_SHIFT            CyUAB_AGND_OFFSET_SHIFT
#define VDAC_Synth_UAB_AGND_OFFSET_MASK             (0x1fUL<<VDAC_Synth_UAB_AGND_OFFSET_SHIFT)



#define VDAC_Synth_UAB_DAC_NEXT_MASK (CyUAB_DAC_NEXT_MASK)


#endif
